---
kind: property
id: P:Autodesk.Revit.DB.GeometryInstance.Transform
zh: 变换
source: html/99cb4580-9b59-6564-8181-6082f275a869.htm
---
# Autodesk.Revit.DB.GeometryInstance.Transform Property

**中文**: 变换

The affine transformation from the local coordinate space of the symbol into the
coordinate space of the instance.

## Syntax (C#)
```csharp
public Transform Transform { get; }
```